Add on testing env
